<template>
	<view class="container" v-html="agreeHtml">
		
	</view>
</template>

<script>
	export default {
		data() {
			return {
				agreeHtml:`<p><span style="font-weight:bold">欢迎您来到何处来族谱。</span><br>请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不进入何处来族谱。当您注册成功后，无论是进入何处来族谱，还是在何处来族谱上发布任何内容（即「内容」），均意味着您（以下称为「用户」，包括但不限于浏览用户、个人作者、组织机构等）完全接受本协议项下的全部条款。<br><br>——总则<br><br>如用户完成注册程序，即表示用户与何处来族谱（包括且不限于网站、手机应用等多平台）就其所提供的服务达成协议，自愿接受本服务协议的所有内容。此后，用户不得以未阅读本服务协议内容为由进行任何形式的抗辩。用户注册成功后，何处来族谱将给予每个用户一个用户账号及对应的密码，该用户账号和密码由用户自己负责保管；用户应当对以其用户账号进行的所有活动和发表的全部内容承担法律责任。<br><br>一，使用规则<br><br>1.1 用户须对其在何处来族谱的注册信息的真实性、合法性、有效性承担责任。用户不得以任何方式(包括但不限于冒用他人姓名/其他组织机构名称、头像、昵称等）冒充他人或其他组织机构；不得利用他人、其他组织机构的名义发布任何信息；不得恶意使用注册账户导致其他用户将其误认为他人或其他组织机构。如用户违反前述约定，何处来族谱有权随时终止对该用户提供服务、收回其账号，并由该用户独立承担由此而产生的一切法律责任。<br><br>1.2 为更好地保护个人用户及组织机构在何处来族谱上的合法权益，用户注册成功后，可进入何处来族谱站内“个人主页”补充完善真实的个人信息，包括但不限于姓名、手机、邮箱、微信账户、企业信息。<br><br>1.3 何处来族谱是一个资讯信息分享、传播、获取及交流的平台，用户通过何处来族谱发表的信息（包括投稿、评论、及使用何处来族谱相应内容、技术服务等）为公开的信息，其他第三方均可以通过何处来族谱获知用户发表的信息，用户对任何信息的发表即承认该信息是公开的信息，并独立对此行为承担法律责任；任何用户不愿被其他第三方获知的信息都不应该在何处来族谱上进行发表。用户向何处来族谱投稿的情况下，应当视为同意何处来族谱有权对其稿件进行相应的处理（包括但不限于删减、编辑、修改、翻译、改编、加注或配图等）或不予发表。<br><br>1.4用户承诺不得以任何方式利用何处来族谱直接或间接从事违反中国法律、法规以及社会公德的行为，何处来族谱有权对违反上述承诺的内容予以删除。<br><br>1.5用户同意将不会利用何处来族谱提供的服务制作、发布、转载或以其他方式传送含有下列内容之一的信息：<br><br>* 反对宪法所确定的基本原则的；<br><br>* 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br><br>* 损害国家荣誉和利益的；<br><br>* 煽动民族仇恨、民族歧视，破坏民族团结的；<br><br>* 破坏国家宗教政策，宣扬邪教和封建迷信的；<br><br>* 散布谣言，扰乱社会秩序，破坏社会稳定的；<br><br>* 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br><br>* 侮辱或者诽谤他人，侵害他人合法权益的；<br><br>* 含有中国法律法规以及其他任何具有法律效力之规范所限制或禁止的其他内容的；<br><br>*含有何处来族谱认为不适合在何处来族谱展示的内容。<br><br>1.6 何处来族谱有权对用户使用何处来族谱的情况进行审查和监督，如用户在使用何处来族谱时违反任何上述规定，何处来族谱或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容、暂停或终止用户使用何处来族谱发布或参与内容获取与交流的权利，以及删除用户账号）以减轻用户不当行为造成的影响。<br><br>二，知识产权<br><br>何处来族谱是一个信息获取、分享、传播及交流的个性化资讯平台，我们尊重和鼓励何处来族谱用户创作和发布的内容，并承诺将保护知识产权作为何处来族谱运营的基本原则之一。<br><br>2.1 用户（包括不限于普通用户、个人作者、组织机构等）在何处来族谱上发表的全部原创文章信息内容及评论内容等，著作权均归用户本人所有。用户可授权第三方以任何方式使用，不需要得到何处来族谱的同意。但若信息内容经何处来族谱编辑、修改、翻译、改编或加注等，用户授权第三方使用前需得到何处来族谱同意。<br><br>2.2 何处来族谱提供的网络服务中包含的标识、版面设计、排版方式、文本、图片、图形等均受著作权、商标权及其它相关权利的法律法规保护，未经相关权利人（含何处来族谱及其他原始权利人）同意，上述内容均不得在任何平台被直接或间接发布、使用、出于发布或使用目的的改写或再发行，或被用于其他任何商业目的。<br><br>2.3 为了促进资讯信息的分享和传播，用户将其在何处来族谱上发表的全部内容，授予何处来族谱免费的、不可撤销的、非独家使用许可，何处来族谱有权将该内容用于何处来族谱及其合作方各种形态的产品和服务上，包括但不限于网站以及发表的应用或其他互联网产品。何处来族谱在与用户协商相关权益（包括且不限于署名、给予一定报酬等）并取得授权后，也有权将内容用于上述许可之外的其他合法用途，包括但不限于部分或者全部地复制、修改、改编、翻译、组装、分拆、推广、分发、广播、表演、演绎、出版。<br><br>2.4 第三方若出于非商业目的，欲将用户在何处来族谱上发表的内容转载在何处来族谱之外的地方，应当在作品正文开头的显著位置注明原作者姓名，给出原始链接，注明「来源何处来族谱」，并且不得擅自对信息内容进行修改演绎。若需要对信息内容进行修改，或用于商业目的，第三方应当参照上述2.1协议内容联系何处来族谱或用户获得单独授权，按照约定的方式使用该内容。<br><br>2.5 何处来族谱为用户提供「独家授权，禁止转载」的选项。除非获得原作者的单独授权，并邮件联系何处来族谱（邮箱：hezuo@huxiu.com），任何第三方不得转载标注了「禁止转载」的内容，否则均视为侵权。<br><br>2.6 在何处来族谱发布创作或评论等内容，用户应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益。如果第三方提出关于著作权的异议，何处来族谱有权根据实际情况整改或删除相关的内容，并有权追究用户的法律责任。给何处来族谱或任何第三方造成损失的，用户应承担全部赔偿责任。<br><br>2.7 如果任何第三方侵犯了何处来族谱用户的相关权利，用户同意授权何处来族谱或其指定的代理人代表何处来族谱或该用户对该第三方提出警告、进行投诉、发起行政执法、提起诉讼、进行上诉，或谈判和解，并且用户同意在何处来族谱认为必要的情况下参与共同维权。<br><br>三，作者认证<br><br>作者认证是何处来族谱对在何处来族谱站内（www.huxiu.com）发表过文章的用户真实身份的确认。获取何处来族谱作者认证标识，用户身份将更易于辨识、更加权威、更有可信度，同时也将获得更多的作者特权。用户可通过“何处来族谱”—“关于我们”—“何处来族谱认证”进入作者认证页面了解详细的认证规则与执行办法。鉴于互联网服务的特殊性，何处来族谱将可能根据自身的发展与规划对规则进行适当调整，并保留对此的最终解释权。<br><br>3.1 独物用户：指享受独物服务的用户。<br><br>四，侵权与维权规则<br><br>4.1 处理原则<br><br>何处来族谱作为个性化资讯获取与交流平台，将在责任范围内最大程度地尊重与保护每一位用户的合法权益，何处来族谱亦未与任何第三方的个人或机构合作开展此项业务。以下所有规则与处理流程，以何处来族谱官方渠道（包括但不限于站内官方认证人员私信、官方邮箱、联系电话等）的回应为准。<br><br>4.2 受理范围<br><br>受理何处来族谱站内侵犯个人或组织机构合法权益的侵权举报，包括但不限于恶意抢注、冒充身份信息、侵犯个人隐私、造谣与诽谤以及商业侵权。<br><br>4.2.1 恶意抢注或冒充身份信息：何处来族谱注册ID信息恶意抢注或冒充他人或其他组织机构，包括但不限于冒用他人姓名/其他组织机构名称、头像、昵称等发布信息，并导致其他用户误认。<br><br>4.2.2 侵犯个人隐私：发布内容中直接涉及他人身份信息，如个人姓名、家庭住址、身份证号码、工作单位、私人电话等。<br><br>4.2.3 造谣与诽谤：发布内容中指名道姓（包括针对个人与组织机构）的直接谩骂、侮辱、虚构中伤、恶意诽谤等。<br><br>4.2.4 商业侵权：泄露企业商业秘密及其他根据保密协议不能公开传播的信息。<br><br>4.3 举报条件<br><br>若个人或组织机构发现何处来族谱上存在侵犯其自身合法权益的内容，可通过邮箱（hezuo@huxiu.com)或电话（010-53526206）与何处来族谱联系。为了保证问题能够得到及时有效的处理，请务必提交真实有效、完整清晰的证明材料，否则何处来族谱将不予受理。具体格式及规定如下：<br><br>4.3.1 权利人对涉嫌侵犯的信息或内容拥有商标权、著作权或其他依法可以行使权利的权属证明文件；若举报人非权利人，请举报人提供代表权利人进行举报的书面授权证明。<br><br>4.3.2 对侵犯了权利人合法权益的内容做充分、明确的描述，提供涉嫌侵犯个人信息或内容在何处来族谱上的具体页面地址，指明涉嫌侵权内容中的哪些信息内容侵犯了上述列明的权利人的合法权益。<br><br>4.3.3 权利人的具体联络信息，包括姓名、身份证或护照复印件（针对自然人）、单位登记证明扫描件、通信地址、电话号码、电子邮件。<br><br>4.3.4 在侵权举报中加入如下关于举报内容真实性的声明：<br><br>* 我本人为涉及侵权的信息内容的合法权利人；<br><br>* 我举报何处来族谱站内的注册用户信息或其发布的内容侵犯了本人相应的合法权益；<br><br>* 如果本侵权举报内容不完全属实，本人将承担由此产生的一切法律责任。<br><br>4.4 处理流程<br><br>* 举报人需明白，出于网络平台的监督属性，并非所有申请都必须受理。何处来族谱将在收到举报材料七个工作日内进行审核并给予回复。<br><br>* 举报人需明白，作为个性化资讯获取与交流平台，何处来族谱允许不同的观点与声音存在，任何个人或组织机构不得以“负面”、“不客观”等模糊性表述为由要求何处来族谱受理删改内容或撤稿等申请。若个人或组织机构认为信息内容数据失实或与事实不符，需指明具体哪些内容中数据失实或与事实不符，并提供相应的证明材料，统一提交至邮箱（hezuo@huxiu.com）后申请受理。<br><br>五，免责声明<br><br>5.1 作为个性化的资讯信息获取与交流平台，何处来族谱有权但无义务对用户发布的所有内容进行审核。<br><br>5.2 针对何处来族谱用户创作、发布的信息内容，何处来族谱并不能保证其真实性和准确性，发布这些信息也不代表何处来族谱证实其描述或赞同其观点。<br><br>5.3 何处来族谱提供的所有信息内容仅供用户参考与交流，不构成商业建议或其他实际的操作意见。何处来族谱有权根据相关证据并结合《中华人民共和国侵权责任法》、《信息网络传播权保护条例》等法律法规对侵权信息进行处理。<br><br>5.4 何处来族谱并不保证其所提供的网络服务一定能满足用户的需求，也不保证其所提供的网络服务不会中断，对于因不可抗力或何处来族谱不能控制的其他原因造成的网络服务中断或其它问题，何处来族谱不承担任何责任，但承诺会尽量减少因此给用户造成的影响和损失。<br><br>5.5 用户知晓并且同意，对于因为不可抗力或何处来族谱不能控制的其他原因（如网络安全漏洞、黑客攻击等）导致的用户资料意外泄漏，何处来族谱不承担相应责任，但承诺会尽量减少因此给用户造成的影响和损失。<br><br>5.6 鉴于互联网服务的特殊性，用户同意何处来族谱有权随时变更、中断或终止其提供的部分或全部网络服务。如需变更、中断或终止其所提供的网络服务，何处来族谱无需通知用户，也无需对任何用户或任何第三方承担任何责任；&nbsp;&nbsp;<br></p>`
			}
		},
		methods: {
			
		},
		onLoad(options) {
			
		},
	}
</script>

<style scoped>
	.container{
		line-height: 250%;
	}
</style>
